---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotPlaceSystemPanelsInOldArcedCurtainWalls
source: html/9133f963-cd57-da6a-1d1c-67c083ad36bc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotPlaceSystemPanelsInOldArcedCurtainWalls Property

Can't place System Panels in arced Curtain Walls created prior to 3.0, nor in straight Curtain Walls created prior to version 2.0.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceSystemPanelsInOldArcedCurtainWalls { get; }
```